
#Область ПрограммныйИнтерфейс
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата,
	|	Реализация.Клиент,
	|	Реализация.Номер,
	|	Реализация.Продавец,
	|	Реализация.Склад,
	|	Реализация.РеализацияТовара.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРеализацияТовараШапка = Макет.ПолучитьОбласть("РеализацияТовараШапка");
	ОбластьРеализацияТовара = Макет.ПолучитьОбласть("РеализацияТовара");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьРеализацияТовараШапка);
		ВыборкаРеализацияТовара = Выборка.РеализацияТовара.Выбрать();
		СуммаИтог = 0;
		Пока ВыборкаРеализацияТовара.Следующий() Цикл
			ОбластьРеализацияТовара.Параметры.Заполнить(ВыборкаРеализацияТовара);
			ТабДок.Вывести(ОбластьРеализацияТовара, ВыборкаРеализацияТовара.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаРеализацияТовара.Сумма;
		КонецЦикла;
		ОбластьИтог.Параметры.ВсегоПоДокументу = СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти