
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	// регистр ОстаткиТоваров Расход
	Для Каждого ТекСтрокаРеализацияТовара Из РеализацияТовара Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаРеализацияТовара.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаРеализацияТовара.Количество;
	
	// регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаРеализацияТовара.Товар;
		Движение.Сотрудник = Продавец;
		Движение.Количество = ТекСтрокаРеализацияТовара.Количество;
		Движение.Выручка = ТекСтрокаРеализацияТовара.Сумма;
		Движение.Стоимость = ТекСтрокаРеализацияТовара.Цена;
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти